- tab: Feedback
  contexts:
  - testcases:
    - expression: complementair( (0, 128, 128) )
      return: "(255, 127, 127)"
  - testcases:
    - expression: complementair( (255, 255, 255) )
      return:
      - 0
      - 0
      - 0
  - testcases:
    - expression: complementair( (0, 0, 0) )
      return:
      - 255
      - 255
      - 255
  - testcases:
    - expression: complementair( (51, 117, 129) )
      return:
      - 204
      - 138
      - 126
  - testcases:
    - expression: complementair( (39, 171, 62) )
      return:
      - 216
      - 84
      - 193
  - testcases:
    - expression: complementair( (76, 179, 12) )
      return:
      - 179
      - 76
      - 243
  - testcases:
    - expression: complementair( (253, 20, 188) )
      return:
      - 2
      - 235
      - 67
  - testcases:
    - expression: complementair( (115, 247, 22) )
      return:
      - 140
      - 8
      - 233
  - testcases:
    - expression: complementair( (234, 113, 65) )
      return:
      - 21
      - 142
      - 190
  - testcases:
    - expression: complementair( (130, 35, 190) )
      return:
      - 125
      - 220
      - 65
  - testcases:
    - expression: complementair( (18, 219, 140) )
      return:
      - 237
      - 36
      - 115
  - testcases:
    - expression: complementair( (157, 195, 94) )
      return:
      - 98
      - 60
      - 161
  - testcases:
    - expression: complementair( (28, 64, 124) )
      return:
      - 227
      - 191
      - 131
  - testcases:
    - expression: complementair( (111, 206, 250) )
      return:
      - 144
      - 49
      - 5
  - testcases:
    - expression: complementair( (89, 233, 30) )
      return:
      - 166
      - 22
      - 225
  - testcases:
    - expression: complementair( (190, 113, 75) )
      return:
      - 65
      - 142
      - 180
  - testcases:
    - expression: complementair( (53, 225, 73) )
      return:
      - 202
      - 30
      - 182
  - testcases:
    - expression: complementair( (206, 121, 106) )
      return:
      - 49
      - 134
      - 149
  - testcases:
    - expression: complementair( (143, 110, 33) )
      return:
      - 112
      - 145
      - 222
  - testcases:
    - expression: complementair( (202, 117, 237) )
      return:
      - 53
      - 138
      - 18
